foampilot/test/coded_fixed_value_vadier_case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
simulationType          RAS;
RAS
{
    RASModel        kOmegaSST;
    turbulence      true;
    printCoeffs     true;
}
